#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:{} arch:headline
#+OPTIONS: author:t c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+OPTIONS: email:nil f:t inline:t num:t p:nil pri:nil prop:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+TITLE: orion-muse
#+AUTHOR: William Henney
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
**** Program to extract a single line extract-em-line.py
+ First go
  + Choose wavelength range around line
    + [ ]This should come from a velocity range really
  + Extract cube that is just the line

#+BEGIN_SRC python :tangle extract-em-line.py
  from __future__ import print_function
  import sys
  import numpy as np
  from astropy.table import Table
  from astropy.io import fits
  from astropy.wcs import WCS
  from astropy import units as u
  from misc_utils import sanitize_string
  sys.path.append('/Users/will/Dropbox/OrionWest/')
  from helio_utils import waves2vels

  linetab = Table.read('basic-line-list.tab', format='ascii.tab')
  wavsectab = Table.read('wavsec-startwavs.tab', format='ascii.tab')

  def find_wavsec(wav):
      """Which wavsec chunk is this wavelength in"""
      return wavsectab['Section'][wav > wavsectab['CRVAL3']].max() 


  def save_linemap_files(wav, species, mapdir='LineMaps', usecont=[1, 1]):
      wavsec = find_wavsec(wav)
      fn = 'muse-hr-data-wavsec{}.fits'.format(wavsec)
      hdulist = fits.open(fn)
      hdu = hdulist['DATA']
      w = WCS(hdu.header)
      helio_hdr = fits.open('muse-hr-window-wfc3-f656n.fits')[0].header
      maps, spec =  extract_line_maps(wav, hdu.data, w, helio_hdr, usecont)
      wavid = str(int(wav+0.5))
      # Save the maps to FITS file 
      for mapid, mapdata in maps.items():
          mhdu = fits.PrimaryHDU(header=w.celestial.to_header(), data=mapdata)
          mname = '{}/{}-{}-{}.fits'.format(mapdir, mapid, species, wavid)
          mhdu.writeto(mname, clobber=True)
      sname = '{}/spec1d-{}-{}.tab'.format(mapdir, species, wavid)
      # And save the spectrum to TSV file
      Table(spec).write(sname, format='ascii.tab')
  
  def extract_line_maps(wav, cube, wcube, helio_hdr,
                        usecont=[1, 1], dwav=4.0, dwavcont=8.0):
      """Extract line moments and continuum"""

      # outer range is wav +/- dwavcont
      wavs = (wav + dwavcont*np.array([-1, 1]))*u.Angstrom.to(u.m)
      _, _, (kout1, kout2) = wcube.all_world2pix([0, 0], [0, 0], wavs, 0)
      kout1, kout2 = int(kout1), int(kout2) + 2

      # inner range is wav +/- dwav
      wavs = (wav + dwav*np.array([-1, 1]))*u.Angstrom.to(u.m)
      _, _, (kin1, kin2) = wcube.all_world2pix([0, 0], [0, 0], wavs, 0)
      kin1, kin2 = int(kin1), int(kin2) + 2

      # find average continuum
      cont1 = np.nanmean(cube[kout1:kin1, :, :], axis=0)
      cont2 = np.nanmean(cube[kin2:kout2, :, :], axis=0)
      # Maybe don't use the continuum on one side (if contaminated)
      wt1, wt2 = usecont          
      avcont = (wt1*cont1 + wt2*cont2)/(wt1 + wt2)

      # Subtract to get pure line window
      linewin = cube[kin1:kin2, :, :] - avcont[None, :, :]
      # Now find moments
      nwin = kin2 - kin1
      _, _, winwavs = wcube.all_pix2world([0]*nwin, [0]*nwin, np.arange(kin1, kin2), 0)
      # Convert wavelengths to velocities
      winvels = waves2vels(winwavs*u.m.to(u.Angstrom), wav, helio_hdr, observatory='VLT4')
      mom0 = linewin.sum(axis=0)
      mom1 = np.sum(linewin*winvels[:, None, None], axis=0)
      vmean = mom1/mom0
      mom2 = np.sum(linewin*(winvels[:, None, None] - vmean)**2, axis=0)
      vsig = np.sqrt(mom2/mom0)
      maps = {'continuum': avcont, 'linesum': mom0,
              'mean': vmean.to(u.km/u.s).value, 'sigma': vsig.to(u.km/u.s).value}

      # Save an average spectrum as well
      nwinout = kout2 - kout1
      _, _, winwavsout = wcube.all_pix2world([0]*nwinout, [0]*nwinout, np.arange(kout1, kout2), 0)
      winvelsout = waves2vels(winwavsout*u.m.to(u.Angstrom), wav, helio_hdr, observatory='VLT4')

      # Just select region to SW of Trap
      xslice = slice(900, 1400)
      yslice = slice(400, 900)
      spec = {
          'vhel': winvelsout.to(u.km/u.s),
          'wav': winwavsout*u.m.to(u.Angstrom),
          'flux': np.nanmean(cube[kout1:kout2, yslice, xslice], axis=(1, 2)),
          'cont': np.nanmean(avcont[yslice, xslice])*np.ones(nwinout),
      }

      return maps, spec


  for row in linetab:
      print(row['Ion'], row['wav0'])
      save_linemap_files(row['wav0'], sanitize_string(row['Ion']),
                         usecont=[row['blue cont'], row['red cont']])


#+END_SRC


#+BEGIN_SRC sh :results silent
mkdir LineMaps
#+END_SRC

Test it out in a shell
#+BEGIN_SRC sh :eval no
python extract-em-line.py
#+END_SRC

Check out the heliocentric correction
#+BEGIN_SRC python :results output
  from __future__ import print_function
  import sys
  from astropy.io import fits
  sys.path.append('/Users/will/Dropbox/OrionWest/')
  from helio_utils import helio_topo_from_header

  hdr = fits.open('muse-hr-window-wfc3-f656n.fits')[0].header
  print(helio_topo_from_header(hdr, observatory='VLT4'))
#+END_SRC

#+RESULTS:
: -16.217273731


** Two-D histogram of MUSE synthetic filter vs MUSE true line ratios
#+BEGIN_SRC python :tangle histo-muse-ratios.py
  from __future__ import print_function
  import numpy as np
  from astropy.io import fits
  from astropy.convolution import convolve, Gaussian2DKernel
  from matplotlib import pyplot as plt
  import seaborn as sns
  from specplot1d_utils import plot_1d_spec_from_fits


  plotpars = {
      '6716-6731': {'line1': '[S II] 6716', 'line2': '[S II] 6731',
                    'min': 0.4, 'max': 1.1},
      '6716-6731-N': {'line1': '[S II] 6716', 'line2': '[S II] 6731',
                    'min': 0.4, 'max': 1.1},
      '5755-6583': {'line1': '[N II] 5755', 'line2': '[N II] 6583',
                    'min': 0.0, 'max': 0.04},
      '4861-6563': {'line1': 'H I 4861', 'line2': 'H I 6563',
                    'min': 0.15, 'max': 0.35},
    }

  titles_from_extra = {
      '': 'Fully continuum-corrected with color terms',
      '-naive': 'Uncorrected for continuum',
      '-flat': 'Partially continuum-corrected but without color terms',
  }

  GAMMA = 1.0

  cmap = sns.light_palette((260, 50, 30), input="husl", as_cmap=True)
  # cmap = plt.cm.gray_r

  def histogram_ratio_images(ratio_name, pars, extra=''):
      ratio_name_true = '-'.join(ratio_name.split('-')[:2])
      fn_true = 'LineMaps/ratio-{}.fits'.format(ratio_name_true)
      fn_syn = 'NebulioMUSE/synthetic{}-ratio-{}.fits'.format(extra, ratio_name)
      pltname = 'NebulioMUSE/synthetic{}-vs-true-calib-{}.pdf'.format(extra, ratio_name)
      hdu_true = fits.open(fn_true)[0]
      hdu_syn = fits.open(fn_syn)[0]
      # Flux of a strong line to weight the pixels
      hduf = fits.open('LineMaps/linesum-H_I-6563.fits')[0]
      x, y, w = hdu_true.data, hdu_syn.data, hduf.data
      xmin, xmax = ymin, ymax = pars['min'], pars['max']
      # mask out silly values
      m = np.isfinite(x) & np.isfinite(y/x) & (np.abs(np.log10(y/x)) < 1.0)
      H, xedges, yedges = np.histogram2d(x[m], y[m], 400,
                                         [[xmin, xmax], [ymin, ymax]],
                                         weights=w[m])
      fig, ax = plt.subplots(1, 1)
      ax.imshow((H.T)**(1.0/GAMMA), extent=[xmin, xmax, ymin, ymax],
                interpolation='nearest', aspect='auto', origin='lower', 
                cmap=cmap, alpha=1.0)
      ax.plot([xmin, xmax], [xmin, xmax], '-', alpha=1.0,
              lw=1, c='r', label=None)
      ax.set_xlabel(
          'MUSE spectrum-derived line ratio: {} / {}'.format(
              pars['line1'], pars['line2']))
      ax.set_ylabel(
          'MUSE synthetic WFC3 filter-derived line ratio: {} / {}'.format(
              pars['line1'], pars['line2']))
      ax.set_xlim(xmin, xmax)
      ax.set_ylim(ymin, ymax)
      ax.text(0.3, 0.05, titles_from_extra[extra], transform=ax.transAxes)

      fig.set_size_inches(7, 7)
      fig.savefig(pltname)

      return pltname


  if __name__ == '__main__':
      for ratio_name, pars in plotpars.items():
          for extra in '', '-naive', '-flat':
              print(histogram_ratio_images(ratio_name, pars, extra))

#+END_SRC

#+RESULTS:

#+BEGIN_SRC sh :results verbatim
python histo-muse-ratios.py
#+END_SRC

#+RESULTS:
#+begin_example
NebulioMUSE/synthetic-vs-true-calib-6716-6731.pdf
NebulioMUSE/synthetic-naive-vs-true-calib-6716-6731.pdf
NebulioMUSE/synthetic-flat-vs-true-calib-6716-6731.pdf
NebulioMUSE/synthetic-vs-true-calib-6716-6731-N.pdf
NebulioMUSE/synthetic-naive-vs-true-calib-6716-6731-N.pdf
NebulioMUSE/synthetic-flat-vs-true-calib-6716-6731-N.pdf
NebulioMUSE/synthetic-vs-true-calib-4861-6563.pdf
NebulioMUSE/synthetic-naive-vs-true-calib-4861-6563.pdf
NebulioMUSE/synthetic-flat-vs-true-calib-4861-6563.pdf
NebulioMUSE/synthetic-vs-true-calib-5755-6583.pdf
NebulioMUSE/synthetic-naive-vs-true-calib-5755-6583.pdf
NebulioMUSE/synthetic-flat-vs-true-calib-5755-6583.pdf
#+end_example

**** DONE [1/1] Print out the mean wavelength and rectangular width of each filter
CLOSED: [2015-10-08 Thu 11:25]
#+name: extract-bandpasses 
#+BEGIN_SRC python :return outtab
  import pysynphot
  from astropy.table import Table
  <<bandpass-fullname-function>>
  float_fmt = '{:.2f}'
  intab = Table.read('all-filters-input.tab', format='ascii.tab')
  outtab = [['Filter', 'Wav0', 'dWav'], None]
  for row in intab:
      fn = bp_fullname(row['Instrument'], row['Filter'])
      bp = pysynphot.ObsBandpass(fn)
      outtab.append([fn, float_fmt.format(bp.avgwave()), float_fmt.format(bp.rectwidth())])
#+END_SRC

#+RESULTS: extract-bandpasses
| Filter            |    Wav0 |    dWav |
|-------------------+---------+---------|
| wfc3,uvis1,f469n  | 4688.14 |   49.67 |
| wfc3,uvis1,f487n  | 4871.42 |   60.41 |
| wfc3,uvis1,f502n  | 5009.71 |   65.27 |
| wfc3,uvis1,f547m  | 5451.37 |  649.89 |
| wfc3,uvis1,fq575n | 5757.87 |   18.37 |
| wfc3,uvis1,f656n  | 6561.44 |   17.65 |
| wfc3,uvis1,f658n  | 6584.91 |   27.55 |
| wfc3,uvis1,fq672n | 6716.62 |   19.37 |
| wfc3,uvis1,f673n  | 6766.04 |  117.78 |
| wfc3,uvis1,fq674n | 6730.77 |   17.63 |
| wfpc2,f502n       | 5013.41 |   35.80 |
| wfpc2,f547m       | 5487.62 |  638.11 |
| wfpc2,f631n       | 6306.45 |   42.14 |
| wfpc2,f656n       | 6563.57 |   28.34 |
| wfpc2,f658n       | 6590.91 |   39.24 |
| wfpc2,f673n       | 6732.30 |   63.31 |
| acs,wfc1,f658n    | 6584.05 |   74.94 |
| acs,wfc1,f660n    | 6599.50 |   35.69 |
| acs,wfc1,f435w    | 4338.43 |  862.30 |
| acs,wfc1,f555w    | 5373.22 | 1124.61 |
| acs,wfc1,f775w    | 7705.71 | 1320.72 |
| acs,wfc1,f850lp   | 9049.59 | 1261.35 |

+ [X] Test that this works on linux server



**** Fold the spectra through each filter to get simulated images
This does not have to be done on the server any more

#+BEGIN_SRC python :tangle filter-flatten.py 
  from __future__ import print_function
  import sys
  <<astro-imports>>
  <<air-refractive-index>>
  <<bandpass-fullname-function>>
  <<flux-to-counts>>

  def bandpass_flatten(instrument, bpname):
      filename = 'muse-hr-window-{}-{}.fits'.format(instrument, bpname)
      hdulist = fits.open(filename)
      hdu = hdulist['DATA']
      w = wcs.WCS(hdu.header)
      NV, NY, NX = hdu.data.shape
      # construct array of observed air wavelengths (at image center to be safe)
      _, _, wavs = w.all_pix2world([NX/2]*NV, [NY/2]*NV, np.arange(NV), 0) 
      # Make dimensional
      wavs *= u.m
      # Convert to vacuum scale
      wavs *= air_refractive_index(wavs)

      # Get bandpass for filter
      fn = bp_fullname(instrument, bpname)
      bp = pysynphot.ObsBandpass(fn)
      # Calculate transmission curve at the observed wavelengths
      T = bp(wavs.to(u.Angstrom).value)
      # Weight by transmission curve and save that
      hdu.data *= T[:, None, None]
      hdulist.writeto(filename.replace('-window-', '-transwin-'), clobber=True)
      # Integrate over wavelength, already weighted by transmission curve. But
      # now need to multiply by wavelength, put in brightness units, and
      # convert to WFC3 electron/s/pixel
      hdu.data *= WFC3_CONSTANT*MUSE_FLUX_UNITS/MUSE_PIXEL_AREA_SR
      hdu.data *= wavs.to(u.Angstrom).value[:, None, None]
      hdu.data = hdu.header['CDELT3']*np.sum(hdu.data, axis=0)
      hdu.header['BUNIT'] = 'electron/s/(0.03962 arcsec)**2'
      hdulist.writeto(filename.replace('-window-', '-image-'), clobber=True)

  if __name__ == '__main__':
      try:
          instrument, bpname = sys.argv[1:]
          bandpass_flatten(instrument, bpname)
      except IndexError:
          print('Usage:', sys.argv[0], 'INSTRUMENT FILTER')
  
#+END_SRC

New example of use, using STSCI python on laptop
#+BEGIN_SRC sh :results silent
source ~/.bash_profile
ur_setup
export PYSYN_CDBS=/Users/will/Dropbox/CDBS
python filter-flatten.py wfc3 fq575n
#+END_SRC


Check the same one using the Anaconda py27 on hypatia, but make sure that we are using the same version of CDBS
#+BEGIN_SRC sh :results silent
source activate py27
export PYSYN_CDBS=/Users/will/Dropbox/CDBS
python filter-flatten.py wfc3 fq575n
#+END_SRC
Exactly the same, which is a heartening.  

Now do it for all the filters
#+BEGIN_SRC sh
  source activate py27
  export PYSYN_CDBS=/Users/will/Dropbox/CDBS
  FILTERS="f469n f487n f502n f547m fq575n f656n f658n fq672n f673n fq674n"
  for f in $FILTERS; do
      echo Flattening $f
      python filter-flatten.py wfc3 $f
  done
#+END_SRC

#+RESULTS:
| Flattening | f469n  |
| Flattening | f487n  |
| Flattening | f502n  |
| Flattening | f547m  |
| Flattening | fq575n |
| Flattening | f656n  |
| Flattening | f658n  |
| Flattening | fq672n |
| Flattening | f673n  |
| Flattening | fq674n |
*** DONE Testing out Montage
CLOSED: [2015-10-14 Wed 09:10]
#+BEGIN_SRC sh :results verbatim
PATH=$PATH:~/Source/Montage/bin
err=$(mProjectPP --help)
echo $err
#+END_SRC

#+RESULTS:
: [struct stat="ERROR", msg="Usage: mProjectPP [-z factor][-d level][-b border][-s statusfile][-o altout.hdr][-i altin.hdr][-h hdu][-x scale][-w weightfile][-t threshold][-X(expand)] in.fits out.fits template.hdr"]
*** DONE Script to resample WFC3 image onto MUSE grid
CLOSED: [2015-10-14 Wed 09:12]
+ Header for MUSE full frame grid: [[file:muse-full-frame.hdr]]
+ This does not expand the WFC3 image beyond its original borders
  + So we will have to extract a section of the MUSE image for comparison
  + On the other hand, it does maintain the same reference pixel
    + But with different values of CRPIX because the image lower left corner is different
    + So it has the same values of CRVAL
    + This will make it easy to slice the MUSE image
+ Smoothing needs to be improved
  + No smoothing is too little
  + The =s120= images that I already have are too much (this was 1.2 arcsec I assume)
  + In the [[id:2E0AC321-C544-4E65-9D59-9A11F96E94BD][t2 notes]] I calculated FWHM of 4 pixels = 0.8 arcsec
  + Actually 0.7 arcsec was better - this is now done in [[id:0CF5E394-36D0-4589-9E02-93EEDE7CF151][the orion-t2.org notes]]
#+BEGIN_SRC sh :tangle wfc3-resample-to-muse.sh
F=$1
MDIR=~/Source/Montage/bin
TDIR=~/Work/RubinWFC3/Tsquared
$MDIR/mProjectPP -h 0 -X $TDIR/full_${F}-s070.fits wfc3-resample-muse-$F.fits muse-full-frame.hdr
#+END_SRC

Test with a single image
#+BEGIN_SRC sh :results verbatim
time sh wfc3-resample-to-muse.sh F547M 2>&1 
#+END_SRC

#+RESULTS:
: [struct stat="OK", time=3]


Do all of the images
#+BEGIN_SRC sh :results verbatim
  FILTERS="f469n f487n f502n f547m fq575n f656n f658n fq672n f673n fq674n"
  for f in $FILTERS; do
      echo "Resampling $f"
      time sh wfc3-resample-to-muse.sh $f
  done
#+END_SRC

#+RESULTS:
#+begin_example
Resampling f469n
[struct stat="OK", time=4]
Resampling f487n
[struct stat="OK", time=3]
Resampling f502n
[struct stat="OK", time=5]
Resampling f547m
[struct stat="OK", time=4]
Resampling fq575n
[struct stat="OK", time=4]
Resampling f656n
[struct stat="OK", time=5]
Resampling f658n
[struct stat="OK", time=4]
Resampling fq672n
[struct stat="OK", time=4]
Resampling f673n
[struct stat="OK", time=5]
Resampling fq674n
[struct stat="OK", time=4]
#+end_example
*** DONE [2/2] Crop MUSE image to the WFC3 field
CLOSED: [2015-10-15 Thu 12:05]
+ [X] This is the final step required before we can do things like take ratio maps or calculate 2d histogram images
+ [X] [2015-10-15 Thu] Also, write out the integrated spectrum times filter throughput for the cropped region
#+BEGIN_SRC python :tangle crop_muse.py
  import sys
  import numpy as np
  from astropy.io import fits
  from astropy.wcs import WCS, WCSSUB_SPECTRAL
  import astropy.units as u

  def crop_muse_to_wfc3(fid):
      """Cut out a section of the MUSE image to match the WFC3 field"""
      wname = 'wfc3-resample-muse-{}.fits'.format(fid)
      mname = 'muse-hr-image-wfc3-{}.fits'.format(fid)
      whdu = fits.open(wname)[0]
      mhdu = fits.open(mname)['DATA']
      # Also get the spectral data cube multiplied by filter throughput
      shdu = fits.open(mname.replace('-image-', '-transwin-'))['DATA']
      wcs_w = WCS(whdu.header).celestial
      wcs_m = WCS(mhdu.header).celestial
      # Check that the two images have the same reference point in RA, DEC
      assert np.all(wcs_w.wcs.crval == wcs_m.wcs.crval)
      # And that the pixel scales are the same
      assert np.all(wcs_w.wcs.cdelt == wcs_m.wcs.cdelt)
      assert np.all(wcs_w.wcs.pc == wcs_m.wcs.pc)

      # The shapes of the two grids: (nx, ny) in FITS axis order
      shape_w = np.array([whdu.header['NAXIS1'], whdu.header['NAXIS2']])
      shape_m = np.array([mhdu.header['NAXIS1'], mhdu.header['NAXIS2']])

      # The difference in CRPIX values tells us the start indices (i, j)
      # for the crop window on the MUSE grid. Note that this is in
      # zero-based array indices
      start = wcs_m.wcs.crpix - wcs_w.wcs.crpix
      # The stop indices for the crop window 
      stop = start + shape_w

      # Shift 1 pixel to the right to do a coarse alignment correction
      start[0] += 1
      stop[0] += 1

      # Check that these are within bounds of the original MUSE grid
      assert np.all(start >= 0.0)
      assert np.all(stop < shape_m)

      # Crop the MUSE data array to the start:stop indices, remembering
      # that python axis order is backwards with respect to FITS axis
      # order
      mhdu.data = mhdu.data[start[1]:stop[1], start[0]:stop[0]]

      # And copy the WFC3 wcs into the new MUSE header
      mhdu.header.update(wcs_w.to_header())

      # Write out the new cropped MUSE image
      oname = mname.replace('-image-', '-cropimage-')
      mhdu.writeto(oname, clobber=True)

      # Finally, as a bonus, calculate the 1-D average spectrum from the cube
      spec = np.nanmean(shdu.data[:, start[1]:stop[1], start[0]:stop[0]], axis=(-1, -2))

      # Convert from 1e-20 flux-per-pixel to surface brightness units (flux per sr)
      pixel_area_sr = np.product(np.abs(wcs_m.wcs.cdelt))*(u.deg.to(u.radian))**2
      spec *= 1e-20/pixel_area_sr
      # extract only the spectral part of the cube's WCS
      wcs_s = WCS(shdu.header).sub([WCSSUB_SPECTRAL])
      oshdu = fits.PrimaryHDU(header=wcs_s.to_header(), data=spec)
      oshdu.header['BUNIT'] = 'erg/s/cm**2/sr/Angstrom'
      # Fix up the wavelngth units to angstrom
      oshdu.header['CDELT1'] *= 1e10
      oshdu.header['CRVAL1'] *= 1e10
      oshdu.header['CUNIT1'] = 'Angstrom'
      # And record the window from the MUSE full field that was extracted
      oshdu.header['MUSE_X1'] = start[0] + 1, 'Extracted window: start X pixel' 
      oshdu.header['MUSE_X2'] = stop[0] + 1, 'Extracted window: stop X pixel' 
      oshdu.header['MUSE_Y1'] = start[1] + 1, 'Extracted window: start Y pixel' 
      oshdu.header['MUSE_Y2'] = stop[0] + 1, 'Extracted window: stop Y pixel' 
      oshdu.writeto(mname.replace('-image-', '-cropspec1d-'), clobber=True)

      return oname


  if __name__ == '__main__':
      try:
          filter_id = sys.argv[1]
      except:
          print('Usage:', sys.argv[0], 'FILTER')

      print(crop_muse_to_wfc3(filter_id))

#+END_SRC

#+BEGIN_SRC sh :results silent
python crop_muse.py f547m
#+END_SRC

#+BEGIN_SRC sh :results verbatim
  FILTERS="f469n f487n f502n f547m fq575n f656n f658n fq672n f673n fq674n"
  for f in $FILTERS; do
      time python crop_muse.py $f
  done
#+END_SRC

#+RESULTS:
#+begin_example
muse-hr-cropimage-wfc3-f469n.fits
muse-hr-cropimage-wfc3-f487n.fits
muse-hr-cropimage-wfc3-f502n.fits
muse-hr-cropimage-wfc3-f547m.fits
muse-hr-cropimage-wfc3-fq575n.fits
muse-hr-cropimage-wfc3-f656n.fits
muse-hr-cropimage-wfc3-f658n.fits
muse-hr-cropimage-wfc3-fq672n.fits
muse-hr-cropimage-wfc3-f673n.fits
muse-hr-cropimage-wfc3-fq674n.fits
#+end_example
*** Two-d histogram of WFC3 vs MUSE-predicted count rates

#+BEGIN_SRC python :tangle histocalib.py
  from __future__ import print_function
  import numpy as np
  from astropy.io import fits
  from astropy.convolution import convolve, Gaussian2DKernel
  from matplotlib import pyplot as plt
  import seaborn as sns
  from specplot1d_utils import plot_1d_spec_from_fits

  maxcount = {
      "fq575n": 0.4,
      "fq672n": 0.6,
      "fq674n": 0.75,
      "f673n" : 2.5,
      "f469n" : 0.5,
      "f487n" : 10.0,
      "f656n" : 40.0, 
      "f658n" : 11.0, 
      "f547m" : 7.0, 
      "f502n" : 20.0,
  }
  GAMMA = 2.0

  cmap = sns.light_palette((260, 50, 30), input="husl", as_cmap=True)
  # cmap = plt.cm.gray_r

  def histogram_calib_images(f, vmax=1.0):
      name1 = 'wfc3-resample-muse-{}.fits'.format(f)
      name2 = 'muse-hr-cropimage-wfc3-{}.fits'.format(f)
      pltname = 'wfc3-vs-muse-calib-{}.pdf'.format(f)
      hdu1 = fits.open(name1)[0]
      hdu2 = fits.open(name2)['DATA']
      hduc = fits.open('wfc3-resample-muse-f547m.fits')[0]
      x, y = hdu2.data, hdu1.data
      xmin, xmax = ymin, ymax = 0.0, vmax
      ew = y/hduc.data
      # mask out silly values
      m = np.isfinite(x) & np.isfinite(y/x) & (np.abs(np.log10(y/x)) < 1.0)
      H, xedges, yedges = np.histogram2d(x[m], y[m], 200,
                                         [[xmin, xmax], [ymin, ymax]],
                                         weights=y[m])
      # Fit a straight line
      mm = m & (x > 0.05*xmax) & (y > 0.05*ymax) & (x < 0.5*xmax) & (y < 0.5*ymax) & (np.abs(np.log10(y/x)) < 0.3)
      # First, linear fit y(x) = m x + c
      y_x_linfit = np.polyfit(x[mm], y[mm], 1, w=y[mm])
      # Second, linear fit x(y) = m y + c
      x_y_linfit = np.polyfit(y[mm], x[mm], 1, w=y[mm])
      # Convert this from x(y) -> y(x)
      # If x = m y + c, then y = (1/m) x - c/m
      y_x_altfit = np.array([1./x_y_linfit[0], -x_y_linfit[1]/x_y_linfit[0]])
      # Take average and spread of these two fits
      y_x_bestfit = 0.5*(y_x_linfit + y_x_altfit)
      y_x_errfit = 0.5*np.abs(y_x_linfit - y_x_altfit)

      pbest =  np.poly1d(y_x_bestfit)

      # H = convolve(H, Gaussian2DKernel(1.0))
      fitcolor = (1.0, 0.5, 0.0)
      fitlabel = "y = ({:.2f} +/- {:.2f}) x + ({:.2f} +/- {:.2f})".format(
          y_x_bestfit[0], y_x_errfit[0], y_x_bestfit[1], y_x_errfit[1])
      fig, ax = plt.subplots(1, 1)
      ax.imshow((H.T)**(1.0/GAMMA), extent=[xmin, xmax, ymin, ymax],
                interpolation='none', aspect='auto', origin='lower', 
                cmap=cmap, alpha=1.0)
      ax.plot([0.0, x[m].max()], [0.0, x[m].max()], '-', alpha=1.0,
              lw=1, c='w', label=None)
      ax.plot([0.0, x[m].max()], pbest([0.0, x[m].max()]), '-', alpha=1.0,
              lw=1, c=fitcolor, label=fitlabel)

      leg = ax.legend(loc='upper left', title='Linear Fit', frameon=True, fancybox=True)
      leg.get_title().set_fontsize('small')
      ax.set_ylabel(
          'Observed WFC3 {} count rate, electron/s/pixel'.format(f.upper()))
      ax.set_xlabel(
          'MUSE-predicted WFC3 {} count rate, electron/s/pixel'.format(f.upper()))
      ax.set_xlim(xmin, xmax)
      ax.set_ylim(ymin, ymax)

      # Now do 1-D histogram of the deviations from the model
      ratio = y/pbest(x)
      if f == 'f547m':
          # Divide into high and low continuum counts
          s = 'counts'
          mlo = (y < y[m].mean()) & m
          mhi = (y >= y[m].mean()) & m
      else:
          # Divide into high and low EW
          s = f.upper() + '/F547M'
          mlo = (ew < np.median(ew[m])) & m
          mhi = (ew >= np.median(ew[m])) & m

      assert mlo.sum() > 0, f
      
      # inset axis at the top left
      ax2 = fig.add_axes([0.2, 0.55, 0.25, 0.25])
      ax2.hist(ratio[mlo], bins=100, range=(0.5, 1.5),
               normed=True, weights=y[mlo], alpha=0.7, label='Low '+s)
      ax2.hist(ratio[mhi], bins=100, range=(0.5, 1.5),
               normed=True, weights=y[mhi], color='red', alpha=0.3, label='High '+s)
      ax2.set_xlim(0.5, 1.5)
      # leave more space at top
      y1, y2 = ax2.get_ylim()
      y2 *= 1.2
      ax2.set_ylim(y1, y2)
      ax2.legend(loc='upper left', fontsize='xx-small')
      ax2.tick_params(labelleft=False, labelsize='x-small')
      ax2.set_xlabel('(Observed Counts) / (Linear Fit)', fontsize='xx-small')
      ax2.set_ylabel('Weighted PDF Histograms', fontsize='xx-small')
  #    ax2.set_title('PDF', fontsize='x-small')

      # inset axis at the bottom right
      ax3 = fig.add_axes([0.6, 0.2, 0.3, 0.3])
      fn = 'muse-hr-cropspec1d-wfc3-{}.fits'.format(f)
      plot_1d_spec_from_fits(fn, ax3, fontsize='xx-small')
      ax3.tick_params(labelsize='xx-small')
      ax3.set_title(f.upper())


      fig.set_size_inches(7, 7)
      fig.savefig(pltname)

      return [pltname, fitlabel]


  if __name__ == '__main__':
      for f, vmax in maxcount.items():
          print(histogram_calib_images(f, vmax))

#+END_SRC

#+RESULTS:


#+BEGIN_SRC sh
python histocalib.py 
#+END_SRC

#+RESULTS:
| ['wfc3-vs-muse-calib-f487n.pdf'  | 'y = (0.99 +/- 0.01) x + (-0.02 +/- 0.02)'] |
| ['wfc3-vs-muse-calib-f658n.pdf'  | 'y = (1.00 +/- 0.01) x + (-0.02 +/- 0.02)'] |
| ['wfc3-vs-muse-calib-f469n.pdf'  | 'y = (0.94 +/- 0.03) x + (-0.00 +/- 0.01)'] |
| ['wfc3-vs-muse-calib-fq674n.pdf' | 'y = (0.98 +/- 0.01) x + (0.01 +/- 0.00)']  |
| ['wfc3-vs-muse-calib-f656n.pdf'  | 'y = (1.02 +/- 0.01) x + (0.18 +/- 0.07)']  |
| ['wfc3-vs-muse-calib-fq672n.pdf' | 'y = (0.97 +/- 0.02) x + (0.01 +/- 0.00)']  |
| ['wfc3-vs-muse-calib-fq575n.pdf' | 'y = (1.00 +/- 0.02) x + (-0.00 +/- 0.00)'] |
| ['wfc3-vs-muse-calib-f673n.pdf'  | 'y = (0.97 +/- 0.01) x + (0.02 +/- 0.01)']  |
| ['wfc3-vs-muse-calib-f547m.pdf'  | 'y = (1.01 +/- 0.01) x + (-0.11 +/- 0.03)'] |
| ['wfc3-vs-muse-calib-f502n.pdf'  | 'y = (0.98 +/- 0.01) x + (-0.01 +/- 0.04)'] |


*** HR cube
:PROPERTIES:
:TABLE_EXPORT_FILE: wavsec-startwavs.tab
:TABLE_EXPORT_FORMAT: orgtbl-to-tsv
:ID:       C2108CD1-EF28-4F63-9CA1-B7F9DA59C450
:END:
+ Exactly the same, except that NV = 5614
  + Wavelength scale: 0.85 angstroms
  + CRPIX3 = 1
  + CRVAL3 = 4595.
+ First try at dividing it up: do it by wavelength
  + Divide into 8 parts of length 702
    + Last one will be 700
  + Size will be 0.702 1.476 1.766 4 = 7.32 GB




#+name: wavsec-startwavs
| Section |  CRVAL3 |
|---------+---------|
|       0 | 4595.00 |
|       1 | 5191.70 |
|       2 | 5788.40 |
|       3 | 6385.10 |
|       4 | 6981.80 |
|       5 | 7578.50 |
|       6 | 8175.20 |
|       7 | 8771.90 |
#+TBLFM: $2=4595.0 + 0.85 702 $1 ;f2

#+BEGIN_SRC python
  from astropy.io import fits
  from astropy import wcs
  import numpy as np

  hdulist = fits.open('DATA/DATACUBEFINALuser_20140216T010259_78380e1d.fits')
  datcube = hdulist['DATA']
  errcube = hdulist['STAT']
  sections = np.arange(8, dtype=int)
  NV = 702
  k1_list = sections*NV
  k2_list = k1_list + NV
  wav0_list = datcube.header['CRVAL3'] + datcube.header['CD3_3']*NV*sections
  for section, k1, k2, wav0 in zip(sections, k1_list, k2_list, wav0_list):
      fn = 'muse-hr-data-wavsec{}.fits'.format(section)
      hdr = datcube.header.copy()
      hdr['CRVAL3'] = wav0
      hdr['NAXIS3'] = NV
      print('Writing', fn)
      fits.PrimaryHDU(header=hdr, data=datcube.data[k1:k2]).writeto(fn)
  
#+END_SRC
